// 描述
// 小乐乐输入百分制成绩，他想将成绩转换成等级制。转换规则为：90-100为’A’，80-89为’B’，70-79为’C’，60-69为’D’，59以下为’E’。如果输入的成绩不在0-100之间，输出’F’。
// 输入描述：
// 一行，一个整数表示的成绩。
// 输出描述：
// 一行，转换后的等级。

#include <stdio.h>

int main() {
    int s  = 0;
    scanf("%d", &s);
    if (s >= 0 && s <= 100) {
        if (s >= 90 && s <= 100) printf("A");
        if (s >= 80 && s <= 89) printf("B");
        if (s >= 70 && s <= 79) printf("C");
        if (s >= 60 && s <= 69) printf("D");
        if (s < 60) printf("E");
    } else printf("F");
}
